In [1]:
import pandas as pd

# Creating dataframes

In [2]:
e = pd.DataFrame()
print(e)

Empty DataFrame
Columns: []
Index: []

In [3]:
l = [2,4,5]
df =pd.DataFrame(l)
print(df)

   0
0  2
1  4
2  5

In [4]:
df

   0
0  2
1  4
2  5

In [5]:
l=[[1,2,3],[4,5,6],[7,8,9]]
df1 = pd.DataFrame(l)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [6]:
dict ={'id':[1,2,3]}
df2 = pd.DataFrame(dict)
df2

   id
0   1
1   2
2   3

In [7]:
dict1 = {'id':[1,2,3],'sr':[1,2,3],'lp':[4,5,6]}
print(dict1)
df2  = pd.DataFrame(dict1)

{'id': [1, 2, 3], 'sr': [1, 2, 3], 'lp': [4, 5, 6]}

In [8]:
df2

   id  sr  lp
0   1   1   4
1   2   2   5
2   3   3   6

In [9]:
dict1 = {'id':1,'sr':2,'lp':4}
print(dict1)

{'id': 1, 'sr': 2, 'lp': 4}

In [11]:
l = [{'a':1,'b':2},{'a':22,'b':33}]
dfs = pd.DataFrame(l)
dfs

    a   b
0   1   2
1  22  33

In [13]:
l = [{'a':1,'b':2},{'c':22,'d':33}]
dfs = pd.DataFrame(l)
dfs

     a    b     c     d
0  1.0  2.0   NaN   NaN
1  NaN  NaN  22.0  33.0

In [15]:
dict_s = {'Id':pd.Series([1,2,3]),'SN':pd.Series([5,6,7])}
df4 = pd.DataFrame(dict_s)
df4

   Id  SN
0   1   5
1   2   6
2   3   7